
function y = mydft(x)
N=size(x);%узнать количество строк и стобцов
if N(1,1)==1 %если количество столбцов =1,то применить алгоритм для вектора-строки  
%NN=N(1,2)
n=[0:1:N(1,2)-1];
k=[0:1:N(1,2)-1];
%a=n'*k
%a1=(cos((2*pi)/N(1,2)*(n'*k))-1i*sin((2*pi)/N(1,2)*(n'*k)))
y=x*(cos((2*pi)/N(1,2)*(n'*k))-1i*sin((2*pi)/N(1,2)*(n'*k)));
else if N(1,2)==1%если количество строк =1,то применить алгоритм для вектора-столбца
%NN=N(1,1)
n=[0:1:N(1,1)-1];
k=[0:1:N(1,1)-1];
%b=n'*k
%b1=(cos(((2*pi)/N(1,1))*n'*k)-1i*sin(((2*pi)/N(1,1))*n'*k))
X=x'*(cos(((2*pi)/N(1,1))*n'*k)-1i*sin(((2*pi)/N(1,1))*n'*k));  
y=X';
else  %иначе применить алгоритм для матрицы      
N=size(x,2);
n=[0:1:N-1];
k=[0:1:N-1];
%b=(cos((2*pi)/N*n'*k)-1i*sin((2*pi)/N*n'*k))
X=x*(cos((2*pi)/N*n'*k)-1i*sin((2*pi)/N*n'*k));
y=X.';
end
end
end


